TwoLayerSerpentineCrossingMixer/FlowCase/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;
nu              __KINEMATIC_VISCOSITY__;
