TwoLayerSerpentineCrossingMixer/FlowCase/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// Bounds and cell counts are materialized from the CAD manifest by
// run_case.py.  The background cell edge is the configured fidelity spacing.
vertices
(
    (__XMIN__ __YMIN__ __ZMIN__)
    (__XMAX__ __YMIN__ __ZMIN__)
    (__XMAX__ __YMAX__ __ZMIN__)
    (__XMIN__ __YMAX__ __ZMIN__)
    (__XMIN__ __YMIN__ __ZMAX__)
    (__XMAX__ __YMIN__ __ZMAX__)
    (__XMAX__ __YMAX__ __ZMAX__)
    (__XMIN__ __YMAX__ __ZMAX__)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (__NX__ __NY__ __NZ__) simpleGrading (1 1 1)
);

edges ();

boundary
(
    background
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
