TwoLayerSerpentineCrossingMixer/FlowCase/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  __CORES__;
method              scotch;
