TwoLayerSerpentineCrossingMixer/FlowCase/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    two_layer_serpentine_crossing_mixer.stl
    {
        type triSurfaceMesh;
        name mixer;
        regions
        {
            inlet1 { name inlet1; }
            inlet2 { name inlet2; }
            outlet { name outlet; }
            walls  { name walls;  }
        }
    }
}

castellatedMeshControls
{
    maxLocalCells       1200000;
    maxGlobalCells      2400000;
    minRefinementCells  0;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features
    (
        {
            file  "two_layer_serpentine_crossing_mixer.eMesh";
            level 0;
        }
    );

    refinementSurfaces
    {
        mixer
        {
            level (0 0);
            patchInfo { type wall; }
            regions
            {
                inlet1 { level (0 0); patchInfo { type patch; } }
                inlet2 { level (0 0); patchInfo { type patch; } }
                outlet { level (0 0); patchInfo { type patch; } }
                walls  { level (0 0); patchInfo { type wall;  } }
            }
        }
    }

    resolveFeatureAngle 30;
    refinementRegions   {};
    locationInMesh      (__LOCATION_X__ __LOCATION_Y__ __LOCATION_Z__);
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch          5;
    tolerance             2.0;
    nSolveIter            100;
    nRelaxIter            10;
    nFeatureSnapIter      15;
    implicitFeatureSnap   false;
    explicitFeatureSnap   true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;
    layers        {};
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    #include "snappyMeshQualityDict"
    nSmoothScale   4;
    errorReduction 0.75;
}

writeFlags
(
    scalarLevels
);

mergeTolerance 1e-6;
