TwoLayerSerpentineCrossingMixer/FlowCase/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

two_layer_serpentine_crossing_mixer.stl
{
    extractionMethod extractFromSurface;
    includedAngle    150;

    subsetFeatures
    {
        nonManifoldEdges yes;
        openEdges        yes;
    }

    writeObj no;
}
